# üåç United Nations Data Analysis

## Load data

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:********@127.0.0.1:3306/united_nations

'Connected: root@united_nations'

In [5]:
%%sql

-- 1. ‚úÖ Show table structure
SHOW COLUMNS FROM united_nations.Access_to_Basic_Services;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
10 rows affected.

[('Region', 'varchar(32)', 'YES', '', None, ''),
 ('Sub_region', 'varchar(25)', 'YES', '', None, ''),
 ('Country_name', 'varchar(37)', 'NO', '', None, ''),
 ('Time_period', 'int', 'NO', '', None, ''),
 ('Pct_managed_drinking_water_services', 'decimal(5,2)', 'YES', '', None, ''),
 ('Pct_managed_sanitation_services', 'decimal(5,2)', 'YES', '', None, ''),
 ('Est_population_in_millions', 'decimal(11,6)', 'YES', '', None, ''),
 ('Est_gdp_in_billions', 'decimal(8,2)', 'YES', '', None, ''),
 ('Land_area', 'decimal(10,2)', 'YES', '', None, ''),
 ('Pct_unemployment', 'decimal(5,2)', 'YES', '', None, '')]

In [28]:
%%sql
-- 2. ‚úÖ Unique combinations of country, time period, population.
SELECT DISTINCT 
    Country_name, 
    Time_period, 
    Est_population_in_millions
FROM united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806')),
 ('Kazakhstan', 2016, Decimal('17.794055')),
 ('Kazakhstan', 2017, Decimal('18.037776')),
 ('Kazakhstan', 2018, Decimal('18.276452')),
 ('Kazakhstan', 2019, Decimal('18.513673'))]

In [13]:
%%sql
-- 3. ‚úÖ Maximum population value
SELECT 
    MAX(Est_population_in_millions) AS Max_population
FROM united_nations.Access_to_Basic_Services;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
1 rows affected.

[(Decimal('1411.100000'),)]

In [29]:
%%sql
-- 4. ‚úÖ Round population estimates to 2 decimal places
SELECT DISTINCT 
    Country_name, 
    Time_period, 
    CAST(Est_population_in_millions AS DECIMAL(6,2)) AS Est_population_in_millions_2dp
FROM united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.54')),
 ('Kazakhstan', 2016, Decimal('17.79')),
 ('Kazakhstan', 2017, Decimal('18.04')),
 ('Kazakhstan', 2018, Decimal('18.28')),
 ('Kazakhstan', 2019, Decimal('18.51'))]

In [30]:
%%sql
-- 5. ‚úÖ Clean country names by removing content in parentheses
SELECT DISTINCT 
    Country_name,
    RTRIM(LEFT(Country_name, POSITION('(' IN Country_name) - 1)) AS Cleaned_Country_Name
FROM united_nations.Access_to_Basic_Services
WHERE Country_name LIKE '%(%)%'
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Iran (Islamic Republic of)', 'Iran'),
 ('Saint Martin (French Part)', 'Saint Martin'),
 ('Sint Maarten (Dutch part)', 'Sint Maarten'),
 ('Bolivia (Plurinational State of)', 'Bolivia'),
 ('Falkland Islands (Malvinas)', 'Falkland Islands')]

In [35]:
%%sql
-- 6. ‚úÖ Identify regions in Africa
SELECT *
FROM united_nations.Access_to_Basic_Services
WHERE Region LIKE "%Africa%"
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Northern Africa and Western Asia', 'Northern Africa', 'Algeria', 2015, Decimal('92.00'), Decimal('85.00'), Decimal('39.543154'), Decimal('165.98'), Decimal('2381741.00'), Decimal('11.21')),
 ('Northern Africa and Western Asia', 'Northern Africa', 'Algeria', 2016, Decimal('93.00'), Decimal('85.33'), Decimal('40.339329'), Decimal('160.03'), Decimal('2381741.00'), Decimal('10.20')),
 ('Northern Africa and Western Asia', 'Northern Africa', 'Algeria', 2017, Decimal('93.00'), Decimal('84.67'), Decimal('41.136546'), Decimal('170.10'), Decimal('2381741.00'), Decimal('12.00')),
 ('Northern Africa and Western Asia', 'Northern Africa', 'Algeria', 2018, Decimal('93.00'), Decimal('84.67'), Decimal('41.927007'), Decimal('174.91'), Decimal('2381741.00'), None),
 ('Northern Africa and Western Asia', 'Northern Africa', 'Algeria', 2019, Decimal('93.33'), Decimal('84.67'), Decimal('42.705368'), Decimal('171.77'), Decimal('2381741.00'), None)]

In [36]:
%%sql
-- 7. ‚úÖ Classify UMA and ECOWAS countries
SELECT
	CASE
		WHEN Country_name IN ('Angola', 'Botswana', 'Comoros', 'Democratic Republic of Congo', 'Eswatini',
						 'Lesotho', 'Madagascar', 'Malawi', 'Mauritius', 'Mozambique', 'Namibia',
						 'Seychelles', 'South Africa', 'United Republic Tanzania', 'Zambia', 'Zimbabwe')
			THEN 'SADC'

		WHEN Country_name IN ('Algeria', 'Libya', 'Mauritania', 'Morocco', 'Tunisia')
			THEN 'UMA'

        WHEN Country_name IN ('Benin', 'Burkina Faso', 'Cabo Verde', 'Cote d‚ÄôIvoire', 'Gambia', 'Ghana', 'Guinea',
							'Guinea-Bissau', 'Liberia', 'Mali', 'Niger', 'Nigeria', 'Senegal', 'Sierra Leone', 'Togo')
			THEN 'ECOWAS'

		ELSE 'Not Classified'
	END AS Regional_economic_community,
	Country_name,
	Pct_managed_drinking_water_services
FROM united_nations.Access_to_Basic_Services
WHERE Region LIKE "%Africa%"
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('UMA', 'Algeria', Decimal('92.00')),
 ('UMA', 'Algeria', Decimal('93.00')),
 ('UMA', 'Algeria', Decimal('93.00')),
 ('UMA', 'Algeria', Decimal('93.00')),
 ('UMA', 'Algeria', Decimal('93.33'))]

In [34]:
%%sql
-- 8. ‚úÖ Classify SADC countries

SELECT
	CASE
		WHEN Country_name IN ('Angola', 'Botswana', 'Comoros', 'Democratic Republic of Congo', 'Eswatini',
						 'Lesotho', 'Madagascar', 'Malawi', 'Mauritius', 'Mozambique', 'Namibia',
						 'Seychelles', 'South Africa', 'United Republic Tanzania', 'Zambia', 'Zimbabwe')
			THEN 'SADC'
		ELSE 'Not Classified'
	END AS Regional_economic_community,
    Country_name,
    Pct_managed_drinking_water_services
FROM united_nations.Access_to_Basic_Services
WHERE Region LIKE "%Africa%"
LIMIT 5; --

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Not Classified', 'Algeria', Decimal('92.00')),
 ('Not Classified', 'Algeria', Decimal('93.00')),
 ('Not Classified', 'Algeria', Decimal('93.00')),
 ('Not Classified', 'Algeria', Decimal('93.00')),
 ('Not Classified', 'Algeria', Decimal('93.33'))]

In [38]:
%%sql
-- 9. ‚úÖ Filter records containing "Korea" in country name
SELECT * 
FROM united_nations.Access_to_Basic_Services AS u
WHERE u.Country_name LIKE '%Korea%'
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Eastern and South-Eastern Asia', 'Eastern Asia', "Democratic People's Republic of Korea", 2015, Decimal('94.67'), Decimal('80.33'), None, None, None, None),
 ('Eastern and South-Eastern Asia', 'Eastern Asia', "Democratic People's Republic of Korea", 2016, Decimal('94.33'), Decimal('81.00'), None, None, None, None),
 ('Eastern and South-Eastern Asia', 'Eastern Asia', "Democratic People's Republic of Korea", 2017, Decimal('94.00'), Decimal('81.67'), None, None, None, None),
 ('Eastern and South-Eastern Asia', 'Eastern Asia', "Democratic People's Republic of Korea", 2018, Decimal('93.33'), Decimal('82.67'), None, None, None, None),
 ('Eastern and South-Eastern Asia', 'Eastern Asia', "Democratic People's Republic of Korea", 2019, Decimal('93.33'), Decimal('83.33'), None, None, None, None)]

In [39]:
%%sql
-- 10. ‚úÖ Replace NULL values for Central and Southern Asia
SELECT Region,
       Pct_unemployment,
       IF( (Region = "Central and Southern Asia") AND (Pct_unemployment IS NULL), 19.59, -999
       ) AS New_pct_unemployment
FROM united_nations.Access_to_Basic_Services
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
10 rows affected.

[('Central and Southern Asia', Decimal('4.93'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.96'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.90'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.85'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.80'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.89'), Decimal('-999')),
 ('Central and Southern Asia', None, Decimal('19.59')),
 ('Central and Southern Asia', None, Decimal('19.59')),
 ('Central and Southern Asia', None, Decimal('19.59')),
 ('Central and Southern Asia', None, Decimal('19.59'))]

In [45]:
%%sql
-- 11. ‚úÖ Replace NULL values for Eastern and South-Eastern Asia
SELECT Region,
       Pct_unemployment,
       IF( (Region = "Central and Southern Asia") AND (Pct_unemployment IS NULL), 19.59,
            IF( (Region = "Eastern and South-Eastern Asia") AND (Pct_unemployment IS NULL), 22.64,
                 -999
            )
       ) AS New_pct_unemployment
FROM united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Central and Southern Asia', Decimal('4.93'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.96'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.90'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.85'), Decimal('-999')),
 ('Central and Southern Asia', Decimal('4.80'), Decimal('-999'))]

In [46]:
%%sql
-- 12. ‚úÖ Replace NULL values for Pct_unemployment based on Region

SELECT 
    Region,
    Pct_unemployment,
    
    CASE 
        WHEN Region = "Central and Southern Asia" AND Pct_unemployment IS NULL THEN 19.59
        WHEN Region = "Eastern and South-Eastern Asia" AND Pct_unemployment IS NULL THEN 22.64
        WHEN Region = "Europe and Northern America" AND Pct_unemployment IS NULL THEN 24.43
        WHEN Region = "Latin America and the Caribbean" AND Pct_unemployment IS NULL THEN 24.23
        WHEN Region = "Northern Africa and Western Asia" AND Pct_unemployment IS NULL THEN 17.84
        WHEN Region = "Oceania" AND Pct_unemployment IS NULL THEN 4.98
        WHEN Region = "Sub-Saharan Africa" AND Pct_unemployment IS NULL THEN 33.65
        ELSE Pct_unemployment
    END AS New_pct_unemployment

FROM united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Central and Southern Asia', Decimal('4.93'), Decimal('4.93')),
 ('Central and Southern Asia', Decimal('4.96'), Decimal('4.96')),
 ('Central and Southern Asia', Decimal('4.90'), Decimal('4.90')),
 ('Central and Southern Asia', Decimal('4.85'), Decimal('4.85')),
 ('Central and Southern Asia', Decimal('4.80'), Decimal('4.80'))]

In [47]:
%%sql
-- 13. ‚úÖ Calculate GDP per Capita
SELECT DISTINCT
    Country_name,
    Time_period,
    Est_population_in_millions,
    Est_gdp_in_billions,
    (Est_gdp_in_billions / Est_population_in_millions) * 1000 AS GDP_per_capita,
    (Est_gdp_in_billions / Est_population_in_millions) * (1000 / 365.25) AS GDP_per_capita_per_day,
    IF(Time_period < 2017, 1.90, 2.50) as Poverty_line,
    CASE
        WHEN  (Est_gdp_in_billions / Est_population_in_millions)*(1000 / 365.25) < IF (Time_period < 2017, 1.90, 2.50)
            THEN 'Low'
        WHEN (Est_gdp_in_billions / Est_population_in_millions)*(1000 / 365.25) > IF (Time_period < 2017, 1.90, 2.50)
            THEN 'High'
        ELSE 'Medium'
    END AS Income_group
FROM united_nations.Access_to_Basic_Services
WHERE Est_gdp_in_billions IS NOT NULL
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806'), Decimal('184.39'), Decimal('10510.861261'), Decimal('28.7771697763'), Decimal('1.90'), 'High'),
 ('Kazakhstan', 2016, Decimal('17.794055'), Decimal('137.28'), Decimal('7714.936253'), Decimal('21.1223442908'), Decimal('1.90'), 'High'),
 ('Kazakhstan', 2017, Decimal('18.037776'), Decimal('166.81'), Decimal('9247.814143'), Decimal('25.3191352293'), Decimal('2.50'), 'High'),
 ('Kazakhstan', 2018, Decimal('18.276452'), Decimal('179.34'), Decimal('9812.626652'), Decimal('26.8655076018'), Decimal('2.50'), 'High'),
 ('Kazakhstan', 2019, Decimal('18.513673'), Decimal('181.67'), Decimal('9812.747584'), Decimal('26.8658386952'), Decimal('2.50'), 'High')]

In [49]:
%%sql
-- 14. ‚úÖ Create a table named Geographic_Location.
CREATE TABLE united_nations.Geographic_Location (
  Country_name VARCHAR(37) PRIMARY KEY,
  Sub_region VARCHAR(25),
  Region VARCHAR(32),
  Land_area NUMERIC(10,2)
);

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
0 rows affected.

[]

In [50]:
%%sql
-- 15. ‚úÖ Extract the relevant columns from the Access_to_Basic_Services table
INSERT INTO united_nations.Geographic_Location (Country_name, Sub_region, Region, Land_area)
SELECT Country_name,
    Sub_region,
    Region,
    AVG(Land_area) as Country_area
FROM united_nations.Access_to_Basic_Services
GROUP BY Country_name,
    Sub_region,
    Region;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
182 rows affected.

[]

In [51]:
%%sql
SHOW COLUMNS FROM united_nations.Geographic_Location

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
4 rows affected.

[('Country_name', 'varchar(37)', 'NO', 'PRI', None, ''),
 ('Sub_region', 'varchar(25)', 'YES', '', None, ''),
 ('Region', 'varchar(32)', 'YES', '', None, ''),
 ('Land_area', 'decimal(10,2)', 'YES', '', None, '')]